Repository: EmFl/ezBadmintonAdmin
Catalog: lib/l10n/app_*.arb
Languages: de

# login
source: Sign in
de: Anmelden

# logout
source: Sign out
de: Abmelden

source: username
de: Benutzername

source: password
de: Passwort

# invalidUsername
source: please enter username
de: Bitte Benutzernamen eingeben

# invalidPassword
source: please enter password
de: Bitte Passwort eingeben

# loginError
source: {errorCode, select, 400{Invalid credentials} other{Unknown sign-in error}}
de: {errorCode, select, 400{Ungültige Anmeldeinformationen} other{Unbekannter Fehler beim Anmelden}}

# overAge
source: over
de: Über

# underAge
source: under
de: Unter

# ageGroup
source: {count, plural, =1{Age group} other{Age groups}}
de: {count, plural, =1{Altersklasse} other{Altersklassen}}

source: club
de: Verein

source: registrations
de: Meldungen

source: age
de: Alter

source: gender
de: Geschlecht

# playingLevel
source: {count, plural, =1{Playing level} other{Playing levels}}
de: {count, plural, =1{Spielklasse} other{Spielklassen}}

# competition
source: {count, plural, =1{Competition} other{Competitions}}
de: {count, plural, =1{Disziplin} other{Disziplinen}}

# baseCompetition
source: {count, plural, =1{Base competition} other{Base competitions}}
de: {count, plural, =1{Basisdisziplin} other{Basisdisziplinen}}

# court
source: {count, plural, =1{Court} other{Courts}}
de: {count, plural, =1{Feld} other{Felder}}

# draw
source: {count, plural, =1{Draw} other{Draws}}
de: {count, plural, =1{Auslosung} other{Auslosungen}}

source: Matches
de: Spiele

source: women
de: Damen

source: men
de: Herren

# womenAbbreviated
source: W
de: D

# menAbbreviated
source: M
de: H

# playerSearchHint
source: Search name/club
de: Name/Verein suchen

# genderCategory
source: {type, select, female{Womens} male{Mens} mixed{Mixed} other{Free}}
de: {type, select, female{Damen} male{Herren} mixed{Mixed} other{Frei}}

# competitionType
source: {type, select, doubles{doubles} mixed{mixed} singles{singles} other{other}}
de: {type, select, doubles{Doppel} mixed{Mixed} singles{Einzel} other{Sonstige}}

# competitionSuffix
source: {type, select, doubles{ doubles} mixed{} singles{ singles} other{ other}}
de: {type, select, doubles{doppel} mixed{} singles{einzel} other{Sonstige}}

# competitionTypeAbbreviated
source: {type, select, doubles{D} mixed{XD} singles{S} other{other}}
de: {type, select, doubles{D} mixed{MX} singles{E} other{Sonst.}}

source: Add
de: Hinzufügen

source: first name
de: Vorname

source: last name
de: Nachname

# player
source: {count, plural, =1{Player} other{Players}}
de: {count, plural, other{Spieler}}

# playerManagement
source: Manage players
de: Spieler verwalten

source: Competition management
de: Disziplinen verwalten

source: Court management
de: Felder verwalten

source: Draw management
de: Auslosungen verwalten

source: birthday
de: Geburtstag

source: date of birth
de: Geburtsdatum

# personalData
source: Personal
de: Zur Person

source: Registered competitions
de: Gemeldete Disziplinen

source: Please fill in
de: Bitte ausfüllen

source: Format error
de: Ungültiges Format

# playerListLoadingError
source: Couldn't load the list of players
de: Konnte die Spielerliste nicht laden

# playerEditorLoadingError
source: Couldn't load the player editor
de: Konnte den Spielereditor nicht laden

# competitionListLoadingError
source: Couldn't load the competition list
de: Konnte die Liste der Disziplinen nicht laden

source: Retry
de: Erneut versuchen

source: Save
de: Speichern

# saveError
source: Saving failed
de: Speichern fehlgeschlagen

source: Add registration
de: Neue Meldung

source: Delete registration
de: Meldung löschen

source: register
de: Melden

source: register partner
de: Partner melden

source: Cancel
de: Abbrechen

# continueMsg
source: Continue
de: Fortfahren

# registrationWarning
source: Registration notice
de: Hinweise zur Meldung

# ageGroupWarning
source: The registered age group is {ageGroup}, the player is {age} years old.
de: Gemeldete Altersklasse ist {ageGroup}, Spieler ist {age}.

# playingLevelWarning
source: The registered playing level is {playingLevel}, the player is of {playerLevel}.
de: Gemeldete Spielklasse ist {playingLevel}, Spieler ist in {playerLevel}.

# genderWarning
source: Player is already registered in a {presentGender} competition. The registration is for a {conflictingGender} competition.
de: Spieler ist schon für eine {presentGender}-Disziplin gemeldet. Meldung ist eine {conflictingGender}-Disziplin.

# withPartner
source: with {partnerName}
de: mit {partnerName}

# noPartner
source: no partner registered
de: kein Partner gemeldet

source: Notes
de: Notizen

source: Unsaved changes
de: Ungesicherte Änderungen

# dismissChanges
source: Dismiss
de: Verwerfen

source: Expand
de: Ausklappen

source: none
de: keine

# playerStatus
source: {type, select, notAttending{Not attending} attending{Attending} forfeited{Gave up} injured{Injured} disqualified{Disqualified} other{Other}}
de: {type, select, notAttending{Nicht anwesend} attending{Anwesend} forfeited{Aufgegeben} injured{Verletzt} disqualified{Disqualifiziert} other{Sonst.}}

source: Change status
de: Status ändern

source: Confirm attendance
de: Anwesenheit bestätigen

source: Done
de: Fertig

source: Search partner
de: Partner suchen

source: Partner needed
de: Partner gesucht

source: Category
de: Kategorie

source: Clear filter
de: Filter löschen

source: Delete player
de: Spieler löschen

source: Really delete player?
de: Spieler wirklich löschen?

source: Confirm
de: Bestätigen

# nPlayersShown
source: {count, plural, =1{1 player listed} other{{count} players listed}}
de: {count, plural, other{{count} Spieler angezeigt}}

# ofN
source: of {number}
de: von {number}

# nSubjectsSelected
source: {count, plural, =0{No {subject} selected} other{{count} {subject} selected}}
de: {count, plural, =0{Keine {subject} ausgewählt} other{{count} {subject} ausgewählt}}

# categorizationHint
source: Enable categorization of the competitions into {category}. This way the same competition (e.g. mixed) can be held more than once for different groups of players.
de: Kategorisierung der Disziplinen in {category}. Die selbe Disziplin (z.B. Mixed) kann so mehrfach für verschiedene Spielergruppen ausgetragen werden.

# activatePlayingLevels
source: Use playing levels
de: Spielklassen verwenden

# activateAgeGroups
source: Use age groups
de: Altersklassen verwenden

source: Edit {subject}
de: {subject} bearbeiten

source: Add {subject}
de: {subject} hinzufügen

source: Delete {subject}
de: {subject} löschen

# deleteSubjectQuestion
source: Delete {subject}?
de: {subject} löschen?

source: name {subject}
de: {subject} benennen

source: Reorder
de: Umordnen

source: Rename
de: Umbenennen

source: Rename {subject}
de: {subject} umbenennen

# chooseCompetitions
source: Choose base competitions
de: Basisdisziplinen wählen

# chooseCategoriesAndCompetitions
source: Choose categories and base competitions
de: Kategorien und Basisdisziplinen wählen

# newCategories
source: {count, plural, =0{No new categories} =1{1 new category} other{{count} new categories}}
de: {count, plural, =0{Keine neuen Kategorien} =1{1 neue Kategorie} other{{count} neue Kategorien}}

# newCompetitions
source: {count, plural, =0{No new competitions} =1{1 new competition} other{{count} new competitions}}
de: {count, plural, =0{Keine neuen Disziplinen} =1{1 neue Disziplin} other{{count} neue Disziplinen}}

# totalNewCompetitions
source: {count, plural, =0{No new competitions} =1{1 new competition total} other{{count} new competitions total}}
de: {count, plural, =0{Keine neuen Disziplinen} =1{Insgesamt 1 neue Disziplin} other{Insgesamt {count} neue Disziplinen}}

# competitionAddingTooltip
source: You chose {categoryCount} {categories} each of which have {baseCompetitionCount} of the base competitions to register players in.
de: Du hast {categoryCount} {categories} gewählt in denen jeweils für {baseCompetitionCount} der Basisdisziplinen gemeldet werden kann.

# combinationsOf
source: combinations of {firstSubject} and {secondSubject}
de: Kombinationen aus {firstSubject} und {secondSubject}

# categoryAlreadyExists
source: All base competitions already exist for this category
de: Für diese Kategorie wurden bereits alle Basisdisziplinen erstellt

# competitionAlreadyExists
source: This competition already exists in one of the selected categories
de: Diese Disziplin wurde bereits in einer der gewählten Kategorien erstellt

# chooseAtLeastN
source: {count, plural, =1{Select at least one {subject}} other{Select at least {count} {subject}}}
de: {count, plural, =1{Wähle min. eine {subject}} other{Wähle min. {count} {subject}}}

# createCategories
source: Create {category}, to be able to add competitions!
de: Erstelle {category}, um Disziplinen hinzufügen zu können!

# defaultPlayingLevel
source: Placeholder playing level
de: Platzhalter-Spielklasse

# disableCategorization
source: Stop using {categorization}?
de: {categorization} nicht mehr verwenden?

# mergeRegistrationsWarning
source: There are registrations in multiple {categorization}. By deactivating {categorization} the competitions and their registration lists are merged. This can't be undone. Continue?
de: Es existieren Meldungen in mehreren {categorization}. Durch das Entfernen der {categorization} werden die Disziplinen und ihre Meldelisten zusammengelegt. Dies kann nicht rückgängig gemacht werden. Forfahren?

# deleteCategoryWarning
source: By deleting the {category} {categoryName} the corresponding competitions are also deleted. Continue?
de: Durch das Löschen der {category} {categoryName} werden auch die entsprechenden Disziplinen gelöscht. Fortfahren?

source: Selection
de: Auswahl

source: No selection
de: Keine Auswahl

source: Continue without selection
de: Ohne Auswahl fortfahren

# deleteAndMergeCategoryWarning
source: By deleting the {category} {categoryName} the corresponding competitions including registrations are also deleted. A replacement {category} can be selected where the registrations will be transferred to:
de: Durch das Löschen der {category} {categoryName} werden auch die entsprechenden Disziplinen inkl. Meldelisten gelöscht. Es kann eine andere {category} ausgewählt werden, in die die Meldelisten übernommen werden:

source: Delete competitions?
de: Disziplinen löschen?

# deleteCompetitionsWarning
source: {count, plural, =1{Really delete the selected competition?} other{Really delete the selected competitions?}}
de: {count, plural, =1{Die ausgewählte Disziplin wirklich löschen?} other{Die ausgewählten Disziplinen wirklich löschen?}}

# deleteCompetitionsWithTeamsWarning
source: The competitions already have registered players.
de: Für die Disziplinen wurden bereits Spieler gemeldet.

source: or more
de: oder mehr

source: or less
de: oder weniger

# showRegistrations
source: Show registration list
de: Meldeliste anzeigen

# gym
source: {count, plural, =1{Hall} other{Halls}}
de: {count, plural, =1{Halle} other{Hallen}}

# row
source: {count, plural, =1{Row} other{Rows}}
de: {count, plural, =1{Reihe} other{Reihen}}

# column
source: {count, plural, =1{Column} other{Columns}}
de: {count, plural, =1{Spalte} other{Spalten}}

source: Description
de: Beschreibung

# gymFloorPlan
source: Hall floor plan
de: Hallenplan

source: Directions
de: Wegbeschreibung

# gymFloorPlanHelpMessage
source: The plan describes how the courts are arranged in the hall. Thus, a maximum of {rows}x{columns} courts fit into the hall. It is up to you which of the courts are actually used.
de: Der Plan beschreibt, wie die Felder in der Halle angeordnet sind. Es passen also maximal {rows}x{columns} Felder in die Halle. Es steht frei, welche der Felder tatsächlich genutzt werden.

source: Court {n}
de: Feld {n}

# noGymnasiumSelected
source: Select a hall to edit the courts
de: Wähle eine Halle, um die Felder zu bearbeiten

# addFirstGymnasium
source: Add your first hall
de: Füge die erste Halle hinzu

source: Reset view
de: Ansicht zurücksetzen

# deleteGymWarning
source: Really delete the hall with all courts?
de: Die Halle mit allen Feldern wirklich löschen?

source: Add all missing courts
de: Alle fehlenden Felder hinzufügen

source: Reduce hall?
de: Halle verkleinern?

# reduceHallWarning
source: By shrinking the hall's floor plan, court will be deleted. Continue?
de: Durch das Verkleinern des Hallenplans werden Felder gelöscht werden. Fortfahren?

# numberCourts
source: Number courts consecutively
de: Felder durchnummerieren

source: Counting direction
de: Zählrichtung

# rowWise
source: Row by row
de: Reihe für Reihe

# columnWise
source: Column by colum
de: Spalte für Spalte

# allGyms
source: Throughout all halls
de: Durch alle Hallen

# onlyGym
source: Just this hall
de: Nur diese Halle

source: Empty courts
de: Leere Felder

source: Skip
de: Überspringen

# count
source: Count in
de: Mitzählen

source: Assign
de: Festlegen

source: Assign tournament mode
de: Turniermodus festlegen

source: Change tournament mode
de: Turniermodus ändern

source: Round robin
de: Jeder gegen Jeden

source: Single elimination
de: KO-System

source: Double elimination
de: Doppeltes KO-System

# classificationElimination
source: Elimination with classification
de: KO-System mit Plätze ausspielen

# groupKnockout
source: Group tournament
de: Gruppensystem

# roundRobinHelp
source: Each participant plays everyone else. How often is determined by the configurable number of rounds.
de: Jeder Teilnehmer spielt gegen jeden Anderen. Die einstellbare Anzahl der Durchgänge bestimmt, wie oft.

# singleEliminationHelp
source: A tournament bracket that ends in a final. To make a match for 3rd place or play out more ranks use the "elimination with classification" mode.
de: Ein Turnierbaum, der in einem Finale gipfelt. Um ein Spiel um Platz 3 zu bekommen oder noch mehr Plätze auszuspielen, nutze das "KO-System mit Plätze ausspielen".

# doubleEliminationHelp
source: In a double elimination participants go into a "lower" bracket after their first loss. Another loss eliminates the participant. The final is played between the last unbeaten participant and the winner of the lower bracket.
de: Bei einem doppelten KO-System kommen Teilnehmer nach der ersten Niederlage in einen "unteren" Turnierbaum. Eine weitere Niederlage führt zum Ausscheiden. Das Finale findet zwischen dem letzten ungeschlagenen Spieler und dem Gewinner des unteren Turniernaums statt.

# classificationEliminationHelp
source: This mode makes the amount of played out ranks configurable. Placements will be played in extra classification rounds, which will be filled by the losers of the main round.
de: Dieser Modus erlaubt es einzustellen, wie viele Plätze ausgespielt werden sollen. Die Plätze werden in Extrarunden ausgespielt, die durch die Verlierer der Hauptrunde besetzt werden.

# groupKnockoutHelp
source: The group stage consists of a round robin in each group. The top ranked participants of each group advance to an elimination stage.
de: In einer Gruppenphase spielen alle Gruppen jeweils ein Jeder-gegen-Jeden. Die Besten jeder Gruppe qualifizieren sich für die KO-Runde.

source: Please choose
de: Bitte wählen

source: Tournament mode
de: Turniermodus

source: Seeding mode
de: Setzplätze

# seedingModeLabel
source: {type, select, single{Single} tiered{Tiered} other{Other}}
de: {type, select, single{Einzeln} tiered{Gestaffelt} other{Sonstige}}

# singleSeedingHelp
source: Every seed list entry gets their own rank.
de: Jeder Eintrag auf der Setzliste erhält seinen eigenen Rang.

# tieredSeedingHelp
source: 1st and 2nd seed are individually set. Afterwards the ranks will be staggered in tiers: 3/4, 5/8, 9/16, etc.
de: 1. und 2. Setzplatz sind einzeln. Danach werden die Ränge gestaffelt: 3/4, 5/8, 9/16, etc.

# passes
source: Rounds
de: Durchgänge

# roundRobinPassesHelp
source: How often everyone plays everyone else. E.g. 2 means each matchup happens twice.
de: Wie oft Jeder gegen Jeden spielt. 2 Durchgänge bedeuten z.B. es gibt eine Hin- und eine Rückrunde.

# numGroups
source: Number of groups
de: Anzahl Gruppen

# numGroupsHelp
source: How many groups the participants will be divided among. Manual assignments are possible after the draw.
de: Auf wie viele Gruppen die Teilnehmer gleichmäßig aufgeteilt werden. Manuelle Zuweisungen sind nach der Auslosung möglich.

source: Qualifications per group
de: Qualifikationen pro Gruppe

# qualificationsPerGroupHelp
source: How many of the top finishers from each group will advance to the knockout round.
de: Wie viele der Top-Platzierten von jeder Gruppe in die KO-Runde einziehen.

# entryList
source: Entry list/Seeds
de: Starterliste/Setzliste

source: Add to seeds
de: Setzplatz geben

source: Remove from seeds
de: Von Setzliste nehmen
